cli/openssl.html
<!DOCTYPE html>
<html lang="en">
<head>
<!-- 2019-02-22 Fri 13:25 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>Openssl</title>
<meta name="generator" content="Org mode">
<meta name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">Openssl</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orgaf2a4c9">1. 基本知识</a>
<ul>
<li><a href="#org5eb78cb">1.1. openssl 组成</a></li>
<li><a href="#org5da8d45">1.2. X509 格式</a></li>
<li><a href="#org7521469">1.3. Diffie-Hellman 交换过程</a></li>
<li><a href="#org79f6016">1.4. 算法种类</a></li>
</ul>
</li>
<li><a href="#orgb876d85">2. 常见用法</a>
<ul>
<li><a href="#org17e634d">2.1. 查询可用子命令</a></li>
<li><a href="#org36dfcda">2.2. 测试各种加密算法的速度</a></li>
<li><a href="#org82c1284">2.3. 加解密</a>
<ul>
<li><a href="#org44c29e0">2.3.1. 加密</a></li>
<li><a href="#orgffd7927">2.3.2. 解密</a></li>
</ul>
</li>
<li><a href="#org8330220">2.4. 计算文件特征码（指纹）</a></li>
<li><a href="#org5bd33fd">2.5. 生成密码串</a></li>
<li><a href="#orgda5c31e">2.6. 制作自签署证书</a>
<ul>
<li><a href="#org5d1c0de">2.6.1. 第一步：生成密钥</a></li>
<li><a href="#org9133d67">2.6.2. 第二步：生成自签署证书</a></li>
</ul>
</li>
<li><a href="#org9133cc3">2.7. 提取公钥</a>
<ul>
<li><a href="#org3fb96e8">2.7.1. 从私钥中提取公钥</a></li>
<li><a href="#orgb890113">2.7.2. 从证书中提取公钥</a></li>
</ul>
</li>
<li><a href="#org8f75458">2.8. 查看证书内容</a></li>
<li><a href="#org19111a5">2.9. 签署证书</a>
<ul>
<li><a href="#orgc74819a">2.9.1. 第一步：部署 CA 证书</a></li>
<li><a href="#org88b90e3">2.9.2. 第二步：生成 csr</a></li>
<li><a href="#org37f372b">2.9.3. 第三步：签署 csr</a></li>
<li><a href="#orgd6f821d">2.9.4. 自动化脚本（可设置证书的有效日期）</a></li>
</ul>
</li>
<li><a href="#orgc9997d5">2.10. 证书格式转换</a>
<ul>
<li><a href="#org78f4780">2.10.1. PKCS#1 =&gt; PKCS#8</a>
<ul>
<li><a href="#orgedc25b1">2.10.1.1. 私钥</a></li>
<li><a href="#org9706194">2.10.1.2. 公钥</a></li>
</ul>
</li>
<li><a href="#orgd55dde4">2.10.2. PKCS#8 =&gt; PKCS#1</a>
<ul>
<li><a href="#org2ecc45a">2.10.2.1. 私钥</a></li>
<li><a href="#org4264496">2.10.2.2. 公钥</a></li>
</ul>
</li>
<li><a href="#org1ccaa81">2.10.3. PEM =&gt; PKCS#12</a></li>
<li><a href="#org686055a">2.10.4. PEM =&gt; DER</a></li>
<li><a href="#orgecb1cd1">2.10.5. DER =&gt; PEM</a></li>
</ul>
</li>
<li><a href="#org0ffea73">2.11. 同时生成密钥和证书</a></li>
<li><a href="#orgf27075d">2.12. 查看服务器证书内容(包含签发者证书)</a></li>
<li><a href="#orgc4ea8c5">2.13. 建立连接</a></li>
<li><a href="#org14ecc5a">2.14. 证书验证</a>
<ul>
<li><a href="#orge78dd47">2.14.1. 验证链</a></li>
<li><a href="#orgcd308ea">2.14.2. 验证签名</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>


<div id="outline-container-orgaf2a4c9" class="outline-2">
<h2 id="orgaf2a4c9"><span class="section-number-2">1</span> 基本知识</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org5eb78cb" class="outline-3">
<h3 id="org5eb78cb"><span class="section-number-3">1.1</span> openssl 组成</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li>libcrypto: 加密库</li>
<li>libssl: TLS/SSL 实现</li>
<li>openssl: 命令行工具</li>
</ul>
</div>
</div>


<div id="outline-container-org5da8d45" class="outline-3">
<h3 id="org5da8d45"><span class="section-number-3">1.2</span> X509 格式</h3>
<div class="outline-text-3" id="text-1-2">
<p>
内容包含：
</p>

<ul class="org-ul">
<li>公钥及其有效期</li>
<li>证书合法拥有者</li>
<li>证书该如何被使用 （用来签名或是用来加密）</li>
<li>CA 的信息</li>
<li>CA 的签名</li>
</ul>
</div>
</div>


<div id="outline-container-org7521469" class="outline-3">
<h3 id="org7521469"><span class="section-number-3">1.3</span> Diffie-Hellman 交换过程</h3>
<div class="outline-text-3" id="text-1-3">
<p>
p：大素数；g：生成数；x：clnt_random；y：srv_random
</p>
</div>
</div>


<div id="outline-container-org79f6016" class="outline-3">
<h3 id="org79f6016"><span class="section-number-3">1.4</span> 算法种类</h3>
<div class="outline-text-3" id="text-1-4">
<ul class="org-ul">
<li>对称加密
<dl class="org-dl">
<dt>DES </dt><dd>56 bits</dd>
<dt>3DES</dt><dd>Tripple DES</dd>
<dt>AES </dt><dd>128 bits</dd>
</dl></li>

<li>单向加密
<ul class="org-ul">
<li>MD5</li>
<li>SHA1, SHA192, SHA256, SHA384</li>
</ul></li>

<li>公钥加密

<ul class="org-ul">
<li>DSA (仅用于签名)</li>
<li>RSA  (可用于加密或签名)</li>
</ul></li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb876d85" class="outline-2">
<h2 id="orgb876d85"><span class="section-number-2">2</span> 常见用法</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org17e634d" class="outline-3">
<h3 id="org17e634d"><span class="section-number-3">2.1</span> 查询可用子命令</h3>
<div class="outline-text-3" id="text-2-1">
<p>
<code>openssl ?</code>
</p>
</div>
</div>


<div id="outline-container-org36dfcda" class="outline-3">
<h3 id="org36dfcda"><span class="section-number-3">2.2</span> 测试各种加密算法的速度</h3>
<div class="outline-text-3" id="text-2-2">
<p>
<code>openssl speed [ciphername]</code>
</p>
</div>
</div>


<div id="outline-container-org82c1284" class="outline-3">
<h3 id="org82c1284"><span class="section-number-3">2.3</span> 加解密</h3>
<div class="outline-text-3" id="text-2-3">
</div>
<div id="outline-container-org44c29e0" class="outline-4">
<h4 id="org44c29e0"><span class="section-number-4">2.3.1</span> 加密</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
<code>openssl enc -des3 -a -in ./test-cipher -out test-cipher.des3</code>
</p>
</div>
</div>


<div id="outline-container-orgffd7927" class="outline-4">
<h4 id="orgffd7927"><span class="section-number-4">2.3.2</span> 解密</h4>
<div class="outline-text-4" id="text-2-3-2">
<p>
<code>openssl enc -des3 -d -a -in ./test-cipher.des3 -out test-cipher</code>
</p>
</div>
</div>
</div>


<div id="outline-container-org8330220" class="outline-3">
<h3 id="org8330220"><span class="section-number-3">2.4</span> 计算文件特征码（指纹）</h3>
<div class="outline-text-3" id="text-2-4">
<p>
<code>openssl dgst -md5 &lt;filename&gt;</code>
</p>
</div>
</div>


<div id="outline-container-org5bd33fd" class="outline-3">
<h3 id="org5bd33fd"><span class="section-number-3">2.5</span> 生成密码串</h3>
<div class="outline-text-3" id="text-2-5">
<p>
<code>openssl passwd -1 -salt &lt;saltvalue&gt;</code>
</p>

<p>
-1 表示 MD5-Based Password algorithm
</p>
</div>
</div>


<div id="outline-container-orgda5c31e" class="outline-3">
<h3 id="orgda5c31e"><span class="section-number-3">2.6</span> 制作自签署证书</h3>
<div class="outline-text-3" id="text-2-6">
<p>
自签署证书一般作为 CA 的证书，普通的证书由 CA 来签署，也可以按照该步骤制作自签署的普通证书（将自身作为 CA ）：
</p>
</div>

<div id="outline-container-org5d1c0de" class="outline-4">
<h4 id="org5d1c0de"><span class="section-number-4">2.6.1</span> 第一步：生成密钥</h4>
<div class="outline-text-4" id="text-2-6-1">
<div class="org-src-container">
<pre class="src src-sh">openssl genrsa 2048 &gt;ca.key.pem    <span style="color: #707070; font-style: italic;">## </span><span style="color: #707070; font-style: italic;">&#29983;&#25104; 2048 &#20301;&#31169;&#38053;</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org9133d67" class="outline-4">
<h4 id="org9133d67"><span class="section-number-4">2.6.2</span> 第二步：生成自签署证书</h4>
<div class="outline-text-4" id="text-2-6-2">
<div class="org-src-container">
<pre class="src src-sh">openssl req -new -x509 -key ca.key.pem -out ca.cert.pem -days 365
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org9133cc3" class="outline-3">
<h3 id="org9133cc3"><span class="section-number-3">2.7</span> 提取公钥</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org3fb96e8" class="outline-4">
<h4 id="org3fb96e8"><span class="section-number-4">2.7.1</span> 从私钥中提取公钥</h4>
<div class="outline-text-4" id="text-2-7-1">
<p>
<code>openssl rsa -in ca.key.pem -pubout</code>
</p>
</div>
</div>

<div id="outline-container-orgb890113" class="outline-4">
<h4 id="orgb890113"><span class="section-number-4">2.7.2</span> 从证书中提取公钥</h4>
<div class="outline-text-4" id="text-2-7-2">
<p>
<code>openssl x509 -pubkey -noout -in &lt;cert.pem&gt; &gt; &lt;pubkey.pem&gt;</code>
</p>
</div>
</div>
</div>

<div id="outline-container-org8f75458" class="outline-3">
<h3 id="org8f75458"><span class="section-number-3">2.8</span> 查看证书内容</h3>
<div class="outline-text-3" id="text-2-8">
<p>
<code>openssl x509 -text -in cert.pem</code>
</p>
</div>
</div>


<div id="outline-container-org19111a5" class="outline-3">
<h3 id="org19111a5"><span class="section-number-3">2.9</span> 签署证书</h3>
<div class="outline-text-3" id="text-2-9">
</div>
<div id="outline-container-orgc74819a" class="outline-4">
<h4 id="orgc74819a"><span class="section-number-4">2.9.1</span> 第一步：部署 CA 证书</h4>
<div class="outline-text-4" id="text-2-9-1">
<div class="org-src-container">
<pre class="src src-sh">mkdir -p $<span style="color: #5fafff;">CATOP</span>/private  <span style="color: #707070; font-style: italic;">## </span><span style="color: #707070; font-style: italic;">$CATOP: ./demoCA</span>
cp ca.key.pem $<span style="color: #5fafff;">CATOP</span>/private/cakey.pem
cp ca.cert.pem $<span style="color: #5fafff;">CATOP</span>/cacert.pem
</pre>
</div>
</div>
</div>


<div id="outline-container-org88b90e3" class="outline-4">
<h4 id="org88b90e3"><span class="section-number-4">2.9.2</span> 第二步：生成 csr</h4>
<div class="outline-text-4" id="text-2-9-2">
<div class="org-src-container">
<pre class="src src-sh">openssl req -new -key webserver.key -out webserver.csr
</pre>
</div>
</div>
</div>


<div id="outline-container-org37f372b" class="outline-4">
<h4 id="org37f372b"><span class="section-number-4">2.9.3</span> 第三步：签署 csr</h4>
<div class="outline-text-4" id="text-2-9-3">
<div class="org-src-container">
<pre class="src src-sh">openssl ca -in webserver.csr -out webserver.crt
</pre>
</div>
</div>
</div>


<div id="outline-container-orgd6f821d" class="outline-4">
<h4 id="orgd6f821d"><span class="section-number-4">2.9.4</span> 自动化脚本（可设置证书的有效日期）</h4>
<div class="outline-text-4" id="text-2-9-4">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #707070; font-style: italic;">#</span><span style="color: #707070; font-style: italic;">!/usr/bin/</span><span style="color: #d787d7; font-weight: bold;">env</span><span style="color: #707070; font-style: italic;"> bash</span>
<span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">-*- coding: utf-8 -*-</span>
<span style="color: #5fafff;">CATOP</span>=./demoCA
rm -rf $<span style="color: #5fafff;">CATOP</span>
mkdir -p $<span style="color: #5fafff;">CATOP</span>/certs           <span style="color: #707070; font-style: italic;">#</span>
mkdir -p $<span style="color: #5fafff;">CATOP</span>/crl             <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#23384;&#25918; Certificate Revoke List</span>
mkdir -p $<span style="color: #5fafff;">CATOP</span>/newcerts        <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#23384;&#25918;&#35777;&#20070;</span>
mkdir -p $<span style="color: #5fafff;">CATOP</span>/private         <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">&#23384;&#25918; CA private key</span>
touch $<span style="color: #5fafff;">CATOP</span>/index.txt          <span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">CA log file</span>
openssl genrsa -out usc.key.pem 2048
openssl req -new -key usc.key.pem -out usc.csr.pem <span style="color: #87af5f;">\</span>
            -subj <span style="color: #87af5f;">"/C=US/ST=Califomia/L=Irvine\</span>
<span style="color: #87af5f;">                   /O=Cisco Systems, Inc./OU=Cisco Small Business/CN=Network Orchestrator"</span>
openssl ca -selfsign -keyfile usc.key.pem -startdate 20160901000000Z <span style="color: #87af5f;">\</span>
           -days 7300 -batch -in usc.csr.pem -out usc.cert.pem -create_serial
rm -rf demoCA
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-orgc9997d5" class="outline-3">
<h3 id="orgc9997d5"><span class="section-number-3">2.10</span> 证书格式转换</h3>
<div class="outline-text-3" id="text-2-10">
<p>
PEM 格式分为 <code>PKCS#1</code> 和 <code>PKCS#8</code> ：
</p>

<table>


<colgroup>
<col  class="org-left">

<col  class="org-left">

<col  class="org-left">
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">Format</th>
<th scope="col" class="org-left">Type</th>
<th scope="col" class="org-left">Header</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">PKCS#1</td>
<td class="org-left">RSAPublicKey</td>
<td class="org-left">BEGIN RSA PUBLIC KEY</td>
</tr>

<tr>
<td class="org-left">PKCS#1</td>
<td class="org-left">RSAPrivateKey</td>
<td class="org-left">BEGIN RSA PRIVATE KEY</td>
</tr>

<tr>
<td class="org-left">PKCS#8</td>
<td class="org-left">PrivateKeyInfo</td>
<td class="org-left">BEGIN PRIVATE KEY</td>
</tr>

<tr>
<td class="org-left">PKCS#8</td>
<td class="org-left">RSAPublicKey</td>
<td class="org-left">BEGIN PUBLIC KEY</td>
</tr>

<tr>
<td class="org-left">PKCS#8</td>
<td class="org-left">EncryptedPrivateKeyInfo</td>
<td class="org-left">BEGIN ENCRYPTED PRIVATE KEY</td>
</tr>
</tbody>
</table>
</div>



<div id="outline-container-org78f4780" class="outline-4">
<h4 id="org78f4780"><span class="section-number-4">2.10.1</span> PKCS#1 =&gt; PKCS#8</h4>
<div class="outline-text-4" id="text-2-10-1">
<p>
openssl 的 <code>genpkey</code> 指令会生成 <code>PKCS#8</code> 格式，而 <code>genrsa</code> 会生成 <code>PKCS#1</code> 格式。
</p>
</div>

<div id="outline-container-orgedc25b1" class="outline-5">
<h5 id="orgedc25b1"><span class="section-number-5">2.10.1.1</span> 私钥</h5>
<div class="outline-text-5" id="text-2-10-1-1">
<div class="org-src-container">
<pre class="src src-sh">openssl pkcs8 -topk8 -inform pem -in key.pem -outform pem -nocrypt -out key.pkcs8.pem
</pre>
</div>
</div>
</div>


<div id="outline-container-org9706194" class="outline-5">
<h5 id="org9706194"><span class="section-number-5">2.10.1.2</span> 公钥</h5>
<div class="outline-text-5" id="text-2-10-1-2">
<div class="org-src-container">
<pre class="src src-sh">openssl rsa  -RSAPublicKey_in -in public_pkcs1.pem  -out public_pkcs8.pem
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-orgd55dde4" class="outline-4">
<h4 id="orgd55dde4"><span class="section-number-4">2.10.2</span> PKCS#8 =&gt; PKCS#1</h4>
<div class="outline-text-4" id="text-2-10-2">
</div>
<div id="outline-container-org2ecc45a" class="outline-5">
<h5 id="org2ecc45a"><span class="section-number-5">2.10.2.1</span> 私钥</h5>
<div class="outline-text-5" id="text-2-10-2-1">
<div class="org-src-container">
<pre class="src src-sh">openssl pkcs8 -in private_pkcs8.pem -nocrypt -out private_pkcs1.pem
</pre>
</div>
</div>
</div>

<div id="outline-container-org4264496" class="outline-5">
<h5 id="org4264496"><span class="section-number-5">2.10.2.2</span> 公钥</h5>
<div class="outline-text-5" id="text-2-10-2-2">
<div class="org-src-container">
<pre class="src src-sh">openssl rsa -pubin -in public.pem -RSAPublicKey_out -out public_pkcs1.pem
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org1ccaa81" class="outline-4">
<h4 id="org1ccaa81"><span class="section-number-4">2.10.3</span> PEM =&gt; PKCS#12</h4>
<div class="outline-text-4" id="text-2-10-3">
<div class="org-src-container">
<pre class="src src-sh">openssl pkcs12 -export -in ./cert.pem -inkey ./key.pem -out hello.p12
</pre>
</div>
</div>
</div>


<div id="outline-container-org686055a" class="outline-4">
<h4 id="org686055a"><span class="section-number-4">2.10.4</span> PEM =&gt; DER</h4>
<div class="outline-text-4" id="text-2-10-4">
<div class="org-src-container">
<pre class="src src-sh">openssl x509 -in cert.pem -outform der -out cert.der
</pre>
</div>
</div>
</div>


<div id="outline-container-orgecb1cd1" class="outline-4">
<h4 id="orgecb1cd1"><span class="section-number-4">2.10.5</span> DER =&gt; PEM</h4>
<div class="outline-text-4" id="text-2-10-5">
<div class="org-src-container">
<pre class="src src-sh">openssl x509 -inform der -in cert.der -outform der -out cert.pem
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org0ffea73" class="outline-3">
<h3 id="org0ffea73"><span class="section-number-3">2.11</span> 同时生成密钥和证书</h3>
<div class="outline-text-3" id="text-2-11">
<div class="org-src-container">
<pre class="src src-sh">openssl req -new -x509 -days 365 -nodes -out cert.pem -keyout key.pem
</pre>
</div>
</div>
</div>


<div id="outline-container-orgf27075d" class="outline-3">
<h3 id="orgf27075d"><span class="section-number-3">2.12</span> 查看服务器证书内容(包含签发者证书)</h3>
<div class="outline-text-3" id="text-2-12">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5fafff; font-weight: bold;">echo</span> | openssl s_client -showcerts -connect 10.74.68.89:443 2&gt;/dev/null <span style="color: #87af5f;">\</span>
    | sed -n <span style="color: #87af5f;">'/BEGIN CERTIFICATE/,/END CERTIFICATE/p'</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-orgc4ea8c5" class="outline-3">
<h3 id="orgc4ea8c5"><span class="section-number-3">2.13</span> 建立连接</h3>
<div class="outline-text-3" id="text-2-13">
<div class="org-src-container">
<pre class="src src-sh">openssl s_client -connect &lt;ip&gt;:&lt;port&gt;
</pre>
</div>
</div>
</div>


<div id="outline-container-org14ecc5a" class="outline-3">
<h3 id="org14ecc5a"><span class="section-number-3">2.14</span> 证书验证</h3>
<div class="outline-text-3" id="text-2-14">
</div>
<div id="outline-container-orge78dd47" class="outline-4">
<h4 id="orge78dd47"><span class="section-number-4">2.14.1</span> 验证链</h4>
<div class="outline-text-4" id="text-2-14-1">
<div class="org-src-container">
<pre class="src src-sh">openssl verify -CAfile &lt;<span style="color: #ff8c00; font-size: 150%;">(</span>cat root.pem intermediate.pem<span style="color: #ff8c00; font-size: 150%;">)</span> &lt;cert_to_verify&gt;.pem
</pre>
</div>
</div>
</div>


<div id="outline-container-orgcd308ea" class="outline-4">
<h4 id="orgcd308ea"><span class="section-number-4">2.14.2</span> 验证签名</h4>
<div class="outline-text-4" id="text-2-14-2">
<div class="org-src-container">
<pre class="src src-sh"><span style="color: #5fafff;">CERT</span>=$<span style="color: #5fafff;">1</span>
<span style="color: #5fafff;">ISSUER</span>=$<span style="color: #5fafff;">2</span>

openssl x509 -in $<span style="color: #5fafff;">ISSUER</span> -noout -pubkey &gt; /tmp/issuer-pub.pem

<span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">extract hex of signature</span>
<span style="color: #5fafff;">SIGNATURE_HEX</span>=$<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #fa8072;">openssl</span> x509 -in $<span style="color: #5fafff;">CERT</span> -text -noout -certopt ca_default <span style="color: #87af5f;">\</span>
                        -certopt no_validity -certopt no_serial <span style="color: #87af5f;">\</span>
                        -certopt no_subject -certopt no_extensions -certopt no_signame <span style="color: #87af5f;">\</span>
                    | grep -v <span style="color: #87af5f;">'Signature Algorithm'</span> | tr -d <span style="color: #87af5f;">'[:space:]:'</span><span style="color: #ff8c00; font-size: 150%;">)</span>
<span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">create signature dump</span>
<span style="color: #5fafff; font-weight: bold;">echo</span> $<span style="color: #ff8c00; font-size: 150%;">{</span><span style="color: #5fafff;">SIGNATURE_HEX</span><span style="color: #ff8c00; font-size: 150%;">}</span> | xxd -r -p &gt; /tmp/cert-sig.bin

<span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">obtain hash function</span>
openssl rsautl -verify -inkey /tmp/issuer-pub.pem <span style="color: #87af5f;">\</span>
        -in /tmp/cert-sig.bin -pubin &gt; /tmp/cert-sig-decrypted.bin
<span style="color: #5fafff;">hash_fun</span>=$<span style="color: #ff8c00; font-size: 150%;">(</span><span style="color: #fa8072;">openssl</span> asn1parse -inform der -in /tmp/cert-sig-decrypted.bin <span style="color: #87af5f;">\</span>
               | grep <span style="color: #87af5f;">'4:d=2  hl=2 l=   9 prim: OBJECT'</span> <span style="color: #87af5f;">\</span>
               | awk <span style="color: #87af5f;">'BEGIN {FS = ":"} {print $4}'</span><span style="color: #ff8c00; font-size: 150%;">)</span>
<span style="color: #5fafff; font-weight: bold;">echo</span> <span style="color: #87af5f;">"Hash: $hash_fun"</span>

openssl asn1parse -in $<span style="color: #5fafff;">CERT</span> -strparse 4 -out /tmp/cert-body.bin -noout
<span style="color: #707070; font-style: italic;"># </span><span style="color: #707070; font-style: italic;">openssl dgst -sha256 /tmp/cert-body.bin</span>
openssl dgst -$<span style="color: #5fafff;">hash_fun</span> -verify /tmp/issuer-pub.pem <span style="color: #87af5f;">\</span>
        -signature /tmp/cert-sig.bin /tmp/cert-body.bin
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>